Documents/АР17_СчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_СчетНаАренду</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_НачислениеАренднойПлаты</xr:Item>
				<xr:Item>Document.АР17_НачислениеПени</xr:Item>
				<xr:Item>Document.АР17_РасторжениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ДополнительноеСоглашение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.АР_РасчетыПоСчетам</xr:Item>
				<xr:Item>AccountingRegister.АР_РасчетыПоСчетамБух</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидыОперацийСчетНаАренду</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьСоответствиеСодержаниюДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаОбъекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолгЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Количество времени приведенное (отношение фактического периода аренды к периодичности начисления)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаСпособаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДоговору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ЦФО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Проект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Депозит</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/АР_ВидыОперацийСчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_ВидыОперацийСчетНаАренду</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР17_СчетНаАренду/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОтменаПроведения;	
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПроверитьСтатусыОбъектовАренды(Отказ)

	Если НеКонтролироватьСоответствиеСодержаниюДоговора ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
		Запрос.УстановитьПараметр("Период", КонецДня(Дата));
		Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Состав", Состав.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АР_СчетНаАрендуСостав.НомерСтроки,
		|	АР_СчетНаАрендуСостав.Номенклатура КАК Услуга,
		|	АР_СчетНаАрендуСостав.ОбъектАренды,
		|	&Договор КАК ДоговорКонтрагента,
		|	&НачалоПериода КАК НачалоПериода,
		|	&КонецПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ ПериодыДокумента
		|ИЗ
		|	&Состав КАК АР_СчетНаАрендуСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
		|ПОМЕСТИТЬ ПериодыАренды
		|ИЗ
		|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыДокумента.НомерСтроки,
		|	ПериодыДокумента.Услуга,
		|	ПериодыДокумента.ОбъектАренды,
		|	ПериодыДокумента.НачалоПериода,
		|	ПериодыДокумента.ОкончаниеПериода,
		|	ВЫБОР
		|		КОГДА ПериодыАренды.ОбъектАренды ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Ошибка
		|ИЗ
		|	ПериодыДокумента КАК ПериодыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыАренды КАК ПериодыАренды
		|		ПО ПериодыДокумента.ОкончаниеПериода >= ПериодыАренды.ДатаНачалаАренды
		|			И ПериодыДокумента.НачалоПериода <= ПериодыАренды.ДатаОкончанияАренды
		|			И ПериодыДокумента.ДоговорКонтрагента = ПериодыАренды.Договор
		|			И ПериодыДокумента.ОбъектАренды = ПериодыАренды.ОбъектАренды
		|			И ПериодыДокумента.Услуга = ПериодыАренды.Услуга
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ПериодыАренды.ОбъектАренды ЕСТЬ NULL 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	Иначе
		Запрос.УстановитьПараметр("Период", КонецДня(Дата));
		Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
		Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Состав", Состав.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АР_СчетНаАрендуСостав.НомерСтроки,
		|	АР_СчетНаАрендуСостав.Номенклатура КАК Услуга,
		|	АР_СчетНаАрендуСостав.ОбъектАренды,
		|	&Договор КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТСостав
		|ИЗ
		|	&Состав КАК АР_СчетНаАрендуСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаАрендуСостав.ОбъектАренды,
		|	СчетНаАрендуСостав.Услуга,
		|	СчетНаАрендуСостав.НомерСтроки,
		|	ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") КАК Статус
		|ИЗ
		|	ВТСостав КАК СчетНаАрендуСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
		|		ПО СчетНаАрендуСостав.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
		|			И СчетНаАрендуСостав.Услуга = АР_СтатусыОбъектовАрендыСрезПоследних.Услуга
		|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &Период)
		|ГДЕ
		|	(НЕ ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") = &ВАренде)";
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЗначениеЗаполнено(Выборка.Услуга) И ЗначениеЗаполнено(Выборка.ОбъектАренды) Тогда
			Префикс = "Состав[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			ТекстСообщения = "Услуга """ + Выборка.Услуга + """ по объекту аренды """ + Выборка.ОбъектАренды + """ не предусмотрена по данному договору";
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "КОРРЕКТНОСТЬ",
				НСтр("ru = 'Услуга'"), Выборка.НомерСтроки, НСтр("ru = 'Состав счета'"), ТекстСообщения);
			Поле = Префикс + "Номенклатура";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для заполнения строк табличной части документа в случае выставления счета на оплату пени
// ПриемникСообщений -- контекст управляемой формы для вывода сообщения
Процедура ЗаполнитьСтрокиПени(ТабСЧетаОтЗДА = Неопределено) Экспорт
	
	Данные = АР_ПроцедурыНачисления.НачислениеПени(ДоговорКонтрагента, Дата);
	
	// + NAI Becar Матюхин Н.О. от 22.09.2016 14:51 по заявке № 97999
	Если ЗначениеЗаполнено(Данные) И ТабСчетаотЗДА <> Неопределено Тогда
	// - NAI Becar Матюхин Н.О.
	
		УслугаПени = Константы.Ар_УслугаПени.Получить();
		
		СоставСтруктуры = "";
		Для каждого ТекКолонка Из Данные.Колонки Цикл
		    СоставСтруктуры = СоставСтруктуры + ТекКолонка.Имя + ",";
		КонецЦикла;
	    СтруктураПервойСтроки = Новый Структура(Лев(СоставСтруктуры,СтрДлина(СоставСтруктуры)-1));
		
		ПерваяСтрокаДанные = Данные[0];
		ЗаполнитьЗначенияСвойств(СтруктураПервойСтроки,ПерваяСтрокаДанные);
		Данные.Очистить();
		
		
		Для каждого СтрТабСчетаЗДА Из ТабСчетаотЗДА Цикл
			Нстрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(Нстрока,СтруктураПервойСтроки);
			
			Нстрока.ДолгЗаПериод = СтрТабСчетаЗДА.СуммаДолга;
			Нстрока.КоличествоДнейПросрочки = СтрТабСчетаЗДА.СрокОплаты;
			НСтрока.СрокОплаты = СтрТабСчетаЗДА.НачалоНачисления;
			Нстрока.Сумма = СтрТабСчетаЗДА.Пени;
			НСтрока.Цена = СтрТабСчетаЗДА.Пени;
			НСтрока.Номенклатура = УслугаПени;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Состав.Загрузить(Данные);
	Иначе
		// + NAI Becar Матюхин Н.О. от 22.09.2016 14:51 по заявке № 97999
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ДокументНеЗаполнен",Истина);
		// - NAI Becar Матюхин Н.О.
		Состав.Очистить();
	КонецЕсли;
			
	Для Каждого СтрокаТЧ Из Состав Цикл
		НаименованиеПолное = СтрокаТЧ.Номенклатура.НаименованиеПолное;
		Если ПустаяСтрока(НаименованиеПолное) Тогда
			СтрокаТЧ.Содержание = СтрокаТЧ.Номенклатура.Наименование;
		Иначе
			СтрокаТЧ.Содержание = НаименованиеПолное;
		КонецЕсли;
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект.СуммаВключаетНДС);
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для заполнения строк табличной части документа по актуальным	данным о депозите
Процедура ЗаполнитьСтрокиДепозит(Основание = Неопределено,ТЗДепозит = Неопределено, Переформировать = Ложь) Экспорт
	
	// + NAI Becar Комментирование Смирнов А.А. от 16.03.2017 11:22
	////////////////////////АР_ПроцедурыНачисления.АР17_ПолучитьПостояннуюЧастьОплаты(ЭтотОбъект,"Состав",Истина, ТЗДепозит);
	////////////////////////АР_ПроцедурыНачисления.АР17_ПолучитьПеременнуюЧастьОплаты(ЭтотОбъект,"Состав",Истина, ТЗДепозит);
	////////////////////////
	СоставТЗ = ЭтотОбъект.Состав.Выгрузить();
	СоставТЗ.Колонки.Добавить("НеУдалять",Новый ОписаниеТипов("Булево"));
	//////////////////
	НомерСтроки = 0;
	Пока НомерСтроки < СоставТЗ.Количество() Цикл
		СтрокаТаб = СоставТЗ[НомерСтроки];
		Если ТЗДепозит <> Неопределено Тогда
			//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
			Если ТЗДепозит.Найти(СтрокаТаб.Номенклатура) <> Неопределено 
				Тогда
				СтрокаТаб.НеУдалять = Истина;
			КонецЕсли;
		КонецЕсли;	
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	НомерСтроки = 0;
	Пока НомерСтроки < СоставТЗ.Количество() Цикл
		СтрокаТаб = СоставТЗ[НомерСтроки];
		Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
			Тогда
			СоставТЗ.Удалить(НомерСтроки);
			НомерСтроки = 0;
		Иначе
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	//////////////////
	
	//ТЗДепозит = СоставТЗ.Скопировать();
	// - NAI Becar Комментирование Смирнов А.А.
	
	Если Состав.Количество() > 0 Тогда
		#Если Клиент Тогда
		Если Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		#КонецЕсли
		Состав.Очистить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		ДобавитьСтрокуДепозита(Основание, ТЗДепозит, Переформировать);
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Дата, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
		|ГДЕ
		|	(АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
		|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор ССЫЛКА Документ.АР17_ДополнительноеСоглашение)
		|	И АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор.УчитыватьЗалог
		|	И АР_СтатусыОбъектовАрендыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде)
		|	И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = &Договор
		|	И АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор.Контрагент = &Контрагент";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДобавитьСтрокуДепозита(Выборка.Регистратор,ТЗДепозит, Переформировать);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура предназначена для заполнения строк табличной части документа по актуальным	данным о депозите
Процедура ДобавитьСтрокуДепозита(Основание,ТЗДепозит,Переформировать) Экспорт 
	
	// + NAI Becar Комментирование Смирнов А.А. от 30.01.2017 17:39
	////////////////////Депозит.Очистить();
	////////////////////Если ТЗДепозит <> Неопределено Тогда
	////////////////////	Для Каждого Стр Из ТЗДепозит Цикл
	////////////////////		//Если Переформировать Тогда
	////////////////////		//	Если Депозит.Найти(Стр.Номенклатура,"Номенклатура") <> Неопределено Тогда 
	////////////////////		//		НовСтрока = Депозит.Найти(Стр.Номенклатура,"Номенклатура");
	////////////////////		//		НовСтрока.Сумма = Стр.Сумма;
	////////////////////		//	Иначе
	////////////////////		//		НовСтрока = Депозит.Добавить();
	////////////////////		//		НовСтрока.Номенклатура = Стр.Номенклатура;
	////////////////////		//		НовСтрока.Сумма = Стр.Сумма;
	////////////////////		//	КонецЕсли;
	////////////////////		//Иначе 	
	////////////////////			НовСтрока = Депозит.Добавить();
	////////////////////			НовСтрока.Номенклатура = Стр.Номенклатура;
	////////////////////			НовСтрока.Сумма = Стр.Сумма;
	////////////////////		//КонецЕсли;	
	////////////////////	КонецЦикла;	
	////////////////////КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	Для Каждого Стр ИЗ Основание.ДепозитСодержаниеИК Цикл
	
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		Коэфф = 1;
		Если НЕ Основание.ВалютаДепозита = ВалютаДокумента Тогда
			СтруктураКурсаДепозита = РаботаСКурсамиВалют.ПолучитьКурсВалюты(?(ЗначениеЗаполнено(Основание.ВалютаДепозита), Основание.ВалютаДепозита, ВалютаРегламентированногоУчета), Дата);
			КурсДепозита      = СтруктураКурсаДепозита.Курс;
			КратностьДепозита = СтруктураКурсаДепозита.Кратность;
			Коэфф = КурсДепозита / КурсВзаиморасчетов * КратностьДепозита / КратностьВзаиморасчетов;
		КонецЕсли;
		СтрокаТЧ = Состав.Добавить();
		СтрокаТЧ.Содержание = Стр.Содержание; //"Страховой депозит по договору " + Основание.ДоговорКонтрагента;
		СтрокаТЧ.Количество = 1;
		// + NAI Becar Комментирование Смирнов А.А. от 31.01.2017 12:30
		//СтрокаТЧ.Цена = Коэфф * Основание.СуммаЗалога;
		//СтрокаТЧ.Сумма = Коэфф * Основание.СуммаЗалога;
		//СтрокаТЧ.СтавкаНДС = Основание.СтавкаНДСЗалога;
		//////////////////СуммаЗалога = Депозит.Итог("Сумма");
		
		СуммаЗалога = РассчитатьСуммуДепозитаПоБУ(Основание); // + NAI Becar Конюшок С.Н. от 21.09.2017 13:15 
		
		СтрокаТЧ.Цена = Коэфф * СуммаЗалога;
		СтрокаТЧ.Сумма = Коэфф * СуммаЗалога;
		СтрокаТЧ.СтавкаНДС = Основание.СтавкаНДСЗалога;
		// - NAI Becar Комментирование Смирнов А.А.
		
			// + Рогачев  Андрей от 21.07.2016  № 106552
			СтрокаТЧ.СтавкаСпособаНачисления= Коэфф * СуммаЗалога;
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
			//СтрокаТЧ.ОбъектАренды =Основание.ОбъектыАренды[0].ОбъектАренды ;
			
			// + NAI Becar Матюхин Н.О. от 11.11.2016 14:49 по заявке № 116341
			НоменклатураДепозит = ПолучитьДепозитИзИК(Основание);
			Если НоменклатураДепозит = Неопределено Тогда
				РезультатЗапроса = Неопределено;
				Если АР_ОбщиеПроцедуры.АР_ПолучитьСвойстваОбъектов(РезультатЗапроса, "ОбеспечительныйПлатеж", "ОбеспечительныйПлатеж") Тогда
					НоменклатураДепозит = РезультатЗапроса.Выгрузить()[0].Значение;
				Иначе
					Если Основание.Депозит.Количество()>0 Тогда
						НоменклатураДепозит = Основание.Депозит[0].Услуга;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			СтрокаТЧ.Номенклатура = НоменклатураДепозит; 
			// - NAI Becar Матюхин Н.О.
			
		КонецЕсли;
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект.СуммаВключаетНДС);
		
	КонецЦикла;	
		
	
КонецПроцедуры

Функция РассчитатьСуммуДепозитаПоБУ(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АР17_ЗаключениеДоговораАренды.СуммаЗалога,
		|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|ПОМЕСТИТЬ ДоговорИСумма
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР17_ЗаключениеДоговораАренды.Ссылка = &Ссылка
		|	И НЕ АР17_ЗаключениеДоговораАренды.ПометкаУдаления
		|	И АР17_ЗаключениеДоговораАренды.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДоговорИСумма.СуммаЗалога, 0) - ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) КАК ОстатокДепозита
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет.Код = ""62.04""
		|				ИЛИ Счет.Код = ""76.09.1"",
		|			,
		|			Субконто2 = &ДоговорКА) КАК ХозрасчетныйОстатки,
		|	ДоговорИСумма КАК ДоговорИСумма";
	
	Запрос.УстановитьПараметр("ДоговорКА", Основание.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Основание);
	////////Запрос.УстановитьПараметр("Счет6204", Счет6204);
	////////Запрос.УстановитьПараметр("Счет76061", Счет76061);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		
		Возврат РЗ.ОстатокДепозита;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДепозитИзИК(Основание)

	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_УстановкаПараметровИКНоменклатура.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	|ГДЕ
	|	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг = &ГруппаУслуг
	|	И АР_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка = &ИКСсылка";
	
	Запрос.УстановитьПараметр("ИКСсылка",Основание.ИК);
	Запрос.УстановитьПараметр("ГруппаУслуг",Справочники.АР_ГруппыУслуг.ОбеспечительныйПлатеж);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ()


// Процедура предназначена для заполнения строк табличной части документа в случае выставления счета на аренду
Процедура ЗаполнитьСтроки(ПостояннаяЧастьОплаты, ЗаполнятьСпециальныйКурс = Ложь, ПризнакСчета = Ложь, ТЗ = Неопределено,Инд = Ложь, СтавкаНДС = Неопределено, СуммаВключаетНДС = Неопределено) Экспорт
	
	Если ПостояннаяЧастьОплаты Тогда
		АР_ПроцедурыНачисления.АР17_ПолучитьПостояннуюЧастьОплаты(ЭтотОбъект,"Состав",ПризнакСчета, ТЗ, Инд, СтавкаНДС, СуммаВключаетНДС);
	Иначе
		АР_ПроцедурыНачисления.АР17_ПолучитьПеременнуюЧастьОплаты(ЭтотОбъект,"Состав",ПризнакСчета, ТЗ, Инд, СтавкаНДС, СуммаВключаетНДС);
	КонецЕсли;
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура СкопироватьСостав(Основание)
	
	Состав.Загрузить(Основание.Состав.Выгрузить());
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	АР_ОбщиеПроцедуры.ЗаполнитьПериодПоУмолчанию(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	Иначе
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	// Заполнение реквизитов, специфичных для документа:
	ДатаКурса = Дата;		
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)

	ДокументОснование = Основание;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды") 
		Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
	
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			ВалютаДокумента = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		НачалоПериода = НачалоМесяца(Дата);
		ОкончаниеПериода = КонецМесяца(Дата);
		ДатаКурса = Дата;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_НачислениеПени")
		Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
		
		СкопироватьСостав(Основание);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_НачислениеПени") Тогда
			ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект,"Состав");
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);// + NAI Becar Конюшок С.Н. от 19.01.2017 17:21 
	
	ОтменаПроведения = Ложь; // + NAI Becar Комментирование Смирнов А.А. от 15.02.2017 10:34
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();

	Если ВидОперации <> Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НачалоПериода");
		МассивНепроверяемыхРеквизитов.Добавить("ОкончаниеПериода");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.Номенклатура");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ОбъектАренды");
	КонецЕсли;

	// + NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда 
		Возврат; 
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	
	// Сделаем проверку на то, что объекты по данному договору находится в аренде
	ПроверитьСтатусыОбъектовАренды(Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли

Процедура ПриЗаписи(Отказ)
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:07 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
	// + NAI Becar Комментирование Смирнов А.А. от 15.02.2017 10:34
	Если ОтменаПроведения = Истина Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Регистратор,
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Документ
		               |ИЗ
		               |	РегистрНакопления.АР_РасчетыПоСчетам.ОстаткиИОбороты(
		               |			&Период,
		               |			,
		               |			Регистратор,
		               |			,
		               |			Договор = &Договор
		               |				И Документ = &Документ) КАК АР_РасчетыПоСчетамОстаткиИОбороты
		               |ГДЕ
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Документ <> АР_РасчетыПоСчетамОстаткиИОбороты.Регистратор";
					   
		Запрос.УстановитьПараметр("Период",ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Договор",ЭтотОбъект.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Документ",ЭтотОбъект.Ссылка);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из Выгрузка Цикл
			Об = Стр.Регистратор.ПолучитьОбъект();
			Об.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;	
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда 
		Возврат; 
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	
	// Вставить содержимое обработчика.
// + Рогачев  Андрей от 28.07.2016  № 106552
	//Если ЭтотОбъект.Передан = '0001-01-01' Тогда 
	//	ЭтотОбъект.Передан = ТекущаяДата();
	//КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда 
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;	
	// + Рогачев  Андрей от 15.08.2016  № 109304
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//

	// + NAI Becar Комментирование Смирнов А.А. от 14.02.2017 11:17
	Движение  = Движения.АР_РасчетыПоСчетам.ДобавитьПриход();
	Движение.Период = ЭтотОбъект.Дата;
	Движение.Документ = ЭтотОбъект.Ссылка;
	Движение.Договор = ЭтотОбъект.ДоговорКонтрагента;
	Движение.Сумма = ЭтотОбъект.СуммаДокумента;
	
	///////
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Регистратор,
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Документ
		               |ИЗ
		               |	РегистрНакопления.АР_РасчетыПоСчетам.ОстаткиИОбороты(, &Период, Регистратор, ,) КАК АР_РасчетыПоСчетамОстаткиИОбороты
		               |ГДЕ
		               |	АР_РасчетыПоСчетамОстаткиИОбороты.Документ <> АР_РасчетыПоСчетамОстаткиИОбороты.Регистратор";
					   
		Запрос.УстановитьПараметр("Период",ЭтотОбъект.Дата);
		//Запрос.УстановитьПараметр("Договор",ЭтотОбъект.ДоговорКонтрагента);
		//Запрос.УстановитьПараметр("Документ",ЭтотОбъект.Ссылка);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из Выгрузка Цикл
			//Об = Стр.Регистратор.ПолучитьОбъект();
			//Об.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;	
	///////
	// - NAI Becar Комментирование Смирнов А.А.

	//*
	Набор = РегистрыБухгалтерии.АР_РасчетыПоСчетамБух.СоздатьНаборЗаписей();
    Набор.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
    Набор.Прочитать();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-1 * АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток
				   //|	АР_РасчетыПоСчетамБухОстатки.Субконто2
	               |ИЗ
	               |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период, Счет В (&МассивСчетов), , Субконто1 = &Договор) КАК АР_РасчетыПоСчетамБухОстатки
	               |ГДЕ
				   |	СуммаОстаток <> 0
				   //|УПОРЯДОЧИТЬ ПО
				   //|	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата
				   |";
				   
	Запрос.УстановитьПараметр("Период",ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Договор",ЭтотОбъект.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата"));
	МассивСчетов = Новый Массив();
	//МассивСчетов.Добавить(ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата"));
	МассивСчетов.Добавить(ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Аванс"));
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей  = ЭтотОбъект.Движения.АР_РасчетыПоСчетамБух;
	
	Если Выгрузка.Количество() > 0 Тогда
		//есть предоплата
		СуммаОст = ЭтотОбъект.СуммаДокумента;
		Для Каждого Стр Из Выгрузка Цикл
			Если СуммаОст > 0 Тогда
				
			    Движение = НаборЗаписей.Добавить();
				Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Аванс");
				Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга");
				Движение.Регистратор = ЭтотОбъект.Ссылка;
				Движение.Период = ЭтотОбъект.Дата;
				
			Движение.СубконтоДт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
			Движение.СубконтоДт.Документы = ЭтотОбъект.Ссылка;
			Движение.СубконтоКт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
			Движение.СубконтоКт.Документы = ЭтотОбъект.Ссылка;
			
				Если СуммаОст > Стр.СуммаОстаток Тогда
					Движение.Сумма = Стр.СуммаОстаток;
				Иначе
					Движение.Сумма = СуммаОст;
				КонецЕсли;
				СуммаОст = СуммаОст - Стр.СуммаОстаток;

			    НаборЗаписей.Записать(Истина);
			
			КонецЕсли;	
		КонецЦикла;
		
		//Если СуммаОст > 0 Тогда
		    Движение = НаборЗаписей.Добавить();
			Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга");
			Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата");
			Движение.Регистратор = ЭтотОбъект.Ссылка;
			Движение.Период = ЭтотОбъект.Дата;
			//Движение.Договор = ЭтотОбъект.ДоговорКонтрагента;
			//Движение.Документ = ЭтотОбъект.Ссылка;
			Движение.СубконтоДт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
			Движение.СубконтоДт.Документы = ЭтотОбъект.Ссылка;
			Движение.СубконтоКт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
			//Движение.СубконтоКт.Документы = ЭтотОбъект.Ссылка;
			Движение.Сумма = ЭтотОбъект.СуммаДокумента;//СуммаОст;
		    НаборЗаписей.Записать(Истина);
		//КонецЕсли;	
		
	Иначе
		//
	    Движение = НаборЗаписей.Добавить();
		Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга");
		Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата");
		Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.Период = ЭтотОбъект.Дата;
		//Движение.Договор = ЭтотОбъект.ДоговорКонтрагента;
		//Движение.Документ = ЭтотОбъект.Ссылка;
		Движение.СубконтоДт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
		Движение.СубконтоДт.Документы = ЭтотОбъект.Ссылка;
		Движение.СубконтоКт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
	    Движение.Сумма = ЭтотОбъект.СуммаДокумента;
	    НаборЗаписей.Записать(Истина);
	КонецЕсли;	
	//*
	
	// + NAI Becar Комментирование Смирнов А.А. от 18.11.2020 12:40
	//Если НайтиПодчиненныйСчет(ЭтотОбъект.Ссылка) <> Неопределено тогда
	//	РН = НайтиПодчиненныйСчет(ЭтотОбъект.Ссылка).ПолучитьОбъект();
	//КонецЕсли;
	
	Если НайтиПодчиненныйСчет(ЭтотОбъект.Ссылка) = Неопределено тогда
		Докум = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
	Иначе
		Докум = НайтиПодчиненныйСчет(ЭтотОбъект.Ссылка).ПолучитьОбъект();
		ЭтотОбъект.НомерСчета = НайтиПодчиненныйСчет(ЭтотОбъект.Ссылка).Номер;
	КонецЕсли;
	
	Докум.Товары.Очистить();
	Если ЭтотОбъект.НомерСчета <> "" Тогда
		Докум.Номер = ЭтотОбъект.НомерСчета;
	КонецЕсли;	
	Докум.ДокументОснование = ЭтотОбъект.Ссылка;
	Докум.Дата = ЭтотОбъект.Дата;
	Докум.Записать(РежимЗаписиДокумента.Запись);
	Докум.Заполнить(ЭтотОбъект.Ссылка);
	Докум.СтруктурнаяЕдиница = ЭтотОбъект.СчетОрганизации;
	Докум.ОрганизацияПолучатель = ЭтотОбъект.Организация;
	Докум.Организация = ЭтотОбъект.Организация;
	Докум.Контрагент = ЭтотОбъект.Контрагент;
	Докум.ДоговорКонтрагента = ЭтотОбъект.ДоговорКонтрагента;
	Докум.СуммаВключаетНДС = ЭтотОбъект.СуммаВключаетНДС;
	Докум.ДокументБезНДС = Ложь; //НЕ ЭтотОбъект.УчитыватьНДС;
	Докум.Товары.Загрузить(ЭтотОбъект.Состав.Выгрузить());
	
	//Докум.БанковскийСчетОрганизации = ЭтотОбъект.СчетОрганизации;
	Если ЭтотОбъект.НомерСчета <> "" Тогда
		Докум.Номер = ЭтотОбъект.НомерСчета;
	КонецЕсли;	
	Докум.Комментарий = "Сделано на основании начисления счета на аренду!";
	//Докум.СоздатьПП = Ложь;
	Докум.Записать(РежимЗаписиДокумента.Проведение);
	// - NAI Becar Комментирование Смирнов А.А. от 18.11.2020 12:40
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 30.09.2016 14:56
Функция НайтиПодчиненныйСчет(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СвязанныеДокументы.Ссылка КАК Счет
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) = ТИП(Документ.СчетНаОплатуПокупателю)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Счет = Выборка.Счет;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции	

Процедура ЗаполнитьСтрокиКоммунальныеУслуги(ЗаполнятьСпециальныйКурс = Ложь, ТЗ=Неопределено) Экспорт
	
	АР_ПроцедурыНачисления.ПолучитьКоммунальныеУслуги(ЭтотОбъект,"Состав",ТЗ);
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОтменаПроведения = Истина; // + NAI Becar Комментирование Смирнов А.А. от 15.02.2017 10:34
	
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);

КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.
